// Задача 1.  Задайте значение N. Напишите программу. которая выведет все натуральные числа
//  в промежутке от 1 до N

// void ShowNumbers(int n)
// {
//     if (n>=1)
//     {
//         ShowNumbers(n-1);
//         System.Console.Write(n+" ");
//     }
// }

// ShowNumbers(6);


// Задание 2 Напишите программу, которая будет принимать на вход число и возвращать сумму его цифр
// 453 -> 12
// 45 -> 9

// int FindSum(int numb)
// {
//     if(numb >0)
//     {
//         return FindSum(numb / 10) + numb % 10;
//     }
//     else return numb;
// }
// System.Console.WriteLine(FindSum(456));







